Terraform Plan:
```aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_execution_role:ecs_execution_role_policy]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/b64f8b6c0b115b04]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_listener.grafana_listener will be updated in-place
  ~ resource "aws_lb_listener" "grafana_listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/b64f8b6c0b115b04"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.grafana_tg must be replaced
-/+ resource "aws_lb_target_group" "grafana_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/grafana-tg/bd60c890dfb7d92f" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/bd60c890dfb7d92f" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "grafana-tg"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ target_type                        = "ip" -> "instance" # forces replacement
        # (7 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.grafana_attachment will be created
  + resource "aws_lb_target_group_attachment" "grafana_attachment" {
      + id               = (known after apply)
      + port             = 3000
      + target_group_arn = (known after apply)
      + target_id        = "i-08bd6045feda93592"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```